#PANDAS

IT PROVIDES SERIES AND DATA FRAME
a pandas series is a 1d array like object that can hold any data type.

In [5]:
import pandas as pd
data = [1,2,3,4,5]
series = pd.Series(data)
print("series\n ",series)
type(series)

series
  0    1
1    2
2    3
3    4
4    5
dtype: int64

pandas.core.series.Series

In [6]:
#create a Series from a dict element
data= {'a':0,'b':1,'c':2}
series_dict = pd.Series(data)
print(series_dict)

a    0
b    1
c    2
dtype: int64

In [8]:
data = [1,2,3,4,5]
series = pd.Series(data,index=['a','b','c','d','e'])
print("series\n ",series)

series
  a    1
b    2
c    3
d    4
e    5
dtype: int64

In [12]:
## Datafram
## create a data frame from a dict

data ={
    'Name':[ 'krish', 'jack', 'jill'],
    'Age':[23,34,45],
    'city':['hyd','del','bang']
}

df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age  city
0  krish   23   hyd
1   jack   34   del
2   jill   45  bang
<class 'pandas.core.frame.DataFrame'>

In [13]:
import numpy as np
np.array(df)

array([['krish', 23, 'hyd'],
       ['jack', 34, 'del'],
       ['jill', 45, 'bang']], dtype=object)

In [14]:
## CREATE A DATAFRAME FROM  ALIST OF DICTIONARY
data =[
    {'a':1,'b':2},
    {'a':5,'b':10,'c':20}
]
df = pd.DataFrame(data)
print(df)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [16]:
print(df['a'])

0    1
1    5
Name: a, dtype: int64

In [17]:
df.at[2, 'a'] = 100
print(df)

       a     b     c
0    1.0   2.0   NaN
1    5.0  10.0  20.0
2  100.0   NaN   NaN

In [18]:

data ={
    'Name':[ 'krish', 'jack', 'jill'],
    'Age':[23,34,45],
    'city':['hyd','del','bang']
}

df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age  city
0  krish   23   hyd
1   jack   34   del
2   jill   45  bang
<class 'pandas.core.frame.DataFrame'>

In [19]:
df

    Name  Age  city
0  krish   23   hyd
1   jack   34   del
2   jill   45  bang

In [ ]:
##ADDING A NEW COLUMN
df['salary']= [50000, 60000, 70000]
df

    Name  Age  city  salary
0  krish   23   hyd   50000
1   jack   34   del   60000
2   jill   45  bang   70000

In [24]:
## REMOVING A COLUMN
df.drop('salary', axis =1)

    Name  Age  city
0  krish   23   hyd
1   jack   34   del
2   jill   45  bang

In [26]:
df

    Name  Age  city  salary
0  krish   23   hyd   50000
1   jack   34   del   60000
2   jill   45  bang   70000

SO DROP IS A TEMPORARY ACTION

SO WE USE INPLACE TO REMOVE IT PERMANANTLY

In [31]:
df.drop('salary', axis =1 , inplace=True)
df

KeyError: "['salary'] not found in axis"

In [32]:
df

    Name  Age  city
0  krish   23   hyd
1   jack   34   del
2   jill   45  bang

In [37]:
## Add age to the column +1 aftter 1 year
df['Age'] = df['Age']+1
df

    Name  Age  city
0  krish   28   hyd
1   jack   39   del
2   jill   50  bang

In [39]:
df.drop(0, inplace = True)
df

   Name  Age  city
1  jack   39   del
2  jill   50  bang

In [40]:
df

   Name  Age  city
1  jack   39   del
2  jill   50  bang

DATA MANIPULATION WITH pandas AND NUMPY

import pandas as pd
df = pd.read_('data.csv)